#ifndef TEXT_H
#define TEXT_H

class Text{

public:
    static inline const QString message = "Удобная «пакетная» загрузка документов. "
                            "Вы можете выбрать сразу несколько документов на своем компьютере и перетащить их в специально предназначенный блок "
                            "для их загрузки. Также, помимо drag-and-drop перемещения документов, вам всегда доступна кнопка для их загрузки. "
                            "Вам не нужно задумываться о формате и расширении документа. Наш сервис автоматически распознает текст.\n"
                            "Проверка на уникальность ваших текстов осуществляется на отдельном сервере — ваши тексты не будут стоять в "
                            "очереди с текстами, проверяемыми через форму на сайте."
                                            "для их загрузки. Также, помимо drag-and-drop перемещения документов, вам всегда доступна кнопка для их загрузки. "
                                            "для их загрузки. Также, помимо drag-and-drop перемещения документов, вам всегда доступна кнопка для их загрузки. "
                                            "для их загрузки. Также, помимо drag-and-drop перемещения документов, вам всегда доступна кнопка для их загрузки. "
                                          ""
                                          "\n\nПривет!! Спасибо за регистрацию! ваш код подтверждения\n\n\n                       ";

    static inline const QString english = "English";
    static inline const QString armenian = "Armenian";


public:
    Text()= delete;
};

#endif // TEXT_H
